// #reLkOkTB29Q
//
//   створити масив книжок (назва, кількість сторінок, автори , жанри).
//
// – знайти найбільшу книжку.
//
// – знайти книжку/ки з найбільшою кількістю жанрів
//
// – знайти книжку/ки з найдовшою назвою
//
// – знайти книжку/ки, які писали 2 автори
//
// – знайти книжку/ки, які писав 1 автор


const books = [
    {
        title: '451 градус за Фаренгейтом',
        pageCount: 	158,
        genres: ['Антиутопія'],
        authors: [
            {
                name:'Рея Бредбері '
            }
        ]
    },
    {
        title: 'Мемуари гейші',
        pageCount: 	158,
        genres: ['Антиутопія'],
        authors: [
            {
                name:'Рея Бредбері '
            }
        ]
    },
]
